import { useState } from "react";
import style from "./AiChance.module.scss";
import Modal from "../../ui/Modal/Modal";

interface AiChanceProps {
  title: string;
  text: string;
  color: string;
  bgColor: string;
}

export function AiChance({ title, text, color, bgColor }: AiChanceProps) {
  const [isOpen, setIsOpen] = useState(false);
  const handleOpen = () => {
    setIsOpen(true);
  };
  const handleClose = () => {
    setIsOpen(false);
  };
  return (
    <>
      <div onClick={handleOpen} className={style.box} style={{ background: `${bgColor}` }}>
        <div className={style.infoBox}>
          <h3 className={style.title} style={{ color: `${color}` }}>
            {title}
          </h3>
          <p className={style.text}>{text}</p>
        </div>
        <div>
          <svg
            width="22"
            height="55"
            viewBox="0 0 22 55"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M11 38C9.62093 38 8.32681 37.7385 7.11766 37.2156C5.90851 36.6993 4.84641 35.9836 3.93137 35.0686C3.01635 34.1536 2.29739 33.0914 1.77451 31.8823C1.25817 30.6732 1 29.379 1 28C1 26.6209 1.25817 25.3268 1.77451 24.1176C2.29739 22.9085 3.01635 21.8464 3.93137 20.9314C4.84641 20.0098 5.90851 19.2908 7.11766 18.7745C8.32681 18.2582 9.62093 18 11 18C12.3791 18 13.6733 18.2582 14.8824 18.7745C16.0915 19.2908 17.1537 20.0098 18.0686 20.9314C18.9837 21.8464 19.6994 22.9085 20.2157 24.1176C20.7386 25.3268 21 26.6209 21 28C21 29.379 20.7386 30.6732 20.2157 31.8823C19.6994 33.0914 18.9837 34.1536 18.0686 35.0686C17.1537 35.9836 16.0915 36.6993 14.8824 37.2156C13.6733 37.7385 12.3791 38 11 38ZM11 36.3333C12.1503 36.3333 13.2288 36.1177 14.2354 35.6863C15.2419 35.2549 16.1275 34.6568 16.8921 33.8922C17.6569 33.1274 18.255 32.2418 18.6863 31.2353C19.1176 30.2288 19.3334 29.1504 19.3334 28C19.3334 26.8497 19.1176 25.7712 18.6863 24.7647C18.255 23.7516 17.6569 22.866 16.8921 22.1078C16.1275 21.3431 15.2419 20.7451 14.2354 20.3137C13.2288 19.8823 12.1503 19.6667 11 19.6667C9.84969 19.6667 8.77126 19.8823 7.76472 20.3137C6.75818 20.7451 5.87256 21.3431 5.10785 22.1078C4.34314 22.866 3.74511 23.7516 3.31373 24.7647C2.88235 25.7712 2.66667 26.8497 2.66667 28C2.66667 29.1504 2.88235 30.2288 3.31373 31.2353C3.74511 32.2418 4.34314 33.1274 5.10785 33.8922C5.87256 34.6568 6.75818 35.2549 7.76472 35.6863C8.77126 36.1177 9.84969 36.3333 11 36.3333ZM9.28434 33.4804C9.08171 33.4804 8.91178 33.415 8.77452 33.2843C8.63727 33.1536 8.56864 32.9901 8.56864 32.7941C8.56864 32.598 8.63727 32.4346 8.77452 32.3039C8.91178 32.1732 9.08171 32.1078 9.28434 32.1078H10.5001V27.6078H9.451C9.24839 27.6078 9.07845 27.5425 8.94119 27.4118C8.80394 27.2811 8.73531 27.1176 8.73531 26.9215C8.73531 26.7255 8.80394 26.5621 8.94119 26.4314C9.07845 26.3006 9.24839 26.2353 9.451 26.2353H11.2942C11.5425 26.2353 11.7321 26.317 11.8628 26.4804C11.9935 26.6372 12.0589 26.8497 12.0589 27.1176V32.1078H13.2745C13.4771 32.1078 13.6471 32.1732 13.7843 32.3039C13.9216 32.4346 13.9902 32.598 13.9902 32.7941C13.9902 32.9901 13.9216 33.1536 13.7843 33.2843C13.6471 33.415 13.4771 33.4804 13.2745 33.4804H9.28434ZM10.9118 24.598C10.5588 24.598 10.2582 24.4738 10.0098 24.2255C9.76146 23.9771 9.63727 23.6765 9.63727 23.3235C9.63727 22.964 9.76146 22.6601 10.0098 22.4118C10.2582 22.1634 10.5588 22.0392 10.9118 22.0392C11.2713 22.0392 11.572 22.1634 11.8137 22.4118C12.0621 22.6601 12.1863 22.964 12.1863 23.3235C12.1863 23.6765 12.0621 23.9771 11.8137 24.2255C11.572 24.4738 11.2713 24.598 10.9118 24.598Z"
              fill="white"
            />
          </svg>
        </div>
      </div>
      <Modal hiddenClose isSpecial isOpen={isOpen} onClose={handleClose}>
        <h3 className={style.titleModal}>Эксперементальная функция с Искусственным интеллеком</h3>
        <p className={style.textModal}>ИИ-аналитика — это умный алгоритм, который отслеживает, как вы используете приложение, и помогает показывать только те предложения, которые действительно вам интересны.</p>
        <p className={style.textModal}>В будущем ИИ будет предлагать персональные офферы с повышенным шансом выигрыша — подобранные именно под ваш стиль игры.</p>
        <p className={style.textModal}>Мы не передаём данные третьим лицам. Все процессы работают внутри приложения. Вы можете отключить аналитику в любое время.</p>
      </Modal>
    </>
  );
}
